#### 1. Create a Datatime index containing all the weekdays days of year 2019 and assign a random number to each of them in a dataframe.

#### 2. Given Pandas series , height = [23,42,55] and weight = [71,32,48] . Create a dataframe with height and weight as column names.

In [1]:
import pandas as pd
titanic_data =  pd.read_csv('/Users/deepakbansal/titanic.csv')
data = [[23,71],[42,32],[55,48]]
data_frame = pd.DataFrame(data, columns = ['height','weight'])
data_frame

   height  weight
0      23      71
1      42      32
2      55      48

#### 3. How to get the items of series A not present in series B .From ser1 remove items present in ser2.
#### ser1 = pd.Series([2,3,4,5])
#### ser2 = pd.Series([5,6,7,8])

In [2]:
ser1 = pd.Series([2,3,4,5])
ser2 = pd.Series([5,6,7,8])
print(ser1[ser1.isin(ser2) == False])
ser1 = ser1.drop(ser1[ser1.isin(ser2)].index)
print(ser1)

0    2
1    3
2    4
dtype: int64
0    2
1    3
2    4
dtype: int64

#### Questions on Titanic Dataset :-

#### 4. Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset

In [3]:
titanic_data = df = pd.read_csv('/Users/deepakbansal/titanic.csv')
print('min =' ,min(titanic_data['Age']))
print('median = ',titanic_data['Age'].median())
print('75th =',titanic_data['Age'].quantile(0.75))
print('max =' ,max(titanic_data['Age']))

min = 0.42
median =  28.0
75th = 38.0
max = 80.0

#### 5. How to get frequency counts of unique items of a series? Calculate the frequency counts of ‘SibSp’ column in titanic Dataset

In [4]:
titanic_data.groupby(['SibSp'])['SibSp'].agg('count')

SibSp
0    608
1    209
2     28
3     16
4     18
5      5
8      7
Name: SibSp, dtype: int64

#### 6. Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset

In [5]:
titanic_data_replace_embarked = titanic_data.replace(titanic_data['Embarked'].value_counts().index[2:],'Other')
titanic_data_replace_embarked.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### 7.  Bin the price column in titanic data set into 5 equal groups and get counts of each bin

In [6]:
titanic_data['Fare_range'] = pd.cut(titanic_data['Fare'],[0,120,340,360,480,600],right=False)
titanic_data.groupby(['Fare_range'])['Fare_range'].agg('count')

Fare_range
[0, 120)      849
[120, 340)     39
[340, 360)      0
[360, 480)      0
[480, 600)      3
Name: Fare_range, dtype: int64

#### 8. Count the number of missing values in each column?

In [7]:
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Fare_range       0
dtype: int64

#### 9. Get the row number of the 5th largest value in the Age column of titanic dataset?

In [8]:
titanic_data.sort_values(by = ['Age'], ascending=False).iloc[4]

PassengerId                     117
Survived                          0
Pclass                            3
Name           Connors, Mr. Patrick
Sex                            male
Age                            70.5
SibSp                             0
Parch                             0
Ticket                       370369
Fare                           7.75
Cabin                           NaN
Embarked                          Q
Fare_range                 [0, 120)
Name: 116, dtype: object

#### 10. Normalize all columns in a dataframe?

#### 11. Get the indices of items of ser2 in ser1 as a list.
#### ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
#### ser2 = pd.Series([1, 3, 10, 13])

In [9]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])
for i in range(0, len(ser2)):
    print(ser1[ser1 == ser2[i]].index[0])

5
4
0
8

#### 12. How to convert a series of date-strings to a timeseries?
#### ['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20']

#### 13. Get the day of month, week number, day of year and day of week from ser.
#### ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

#### 14. Compute the euclidean distance between series (points) p and q, without using a packaged formula.
#### p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
#### q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

#### 15. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays/sundays)

#### 16. Import every 50th row of BostonHousing dataset as a dataframe.